Revit 2027 API
ComponentRepeater.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<ComponentRepeaterSlot> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of ComponentRepeaterSlot)
public:
virtual IEnumerator<ComponentRepeaterSlot^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<ComponentRepeaterSlot>
override GetEnumerator : unit -> IEnumerator<ComponentRepeaterSlot>
Return Value
IEnumerator<ComponentRepeaterSlot>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ComponentRepeater Class
Autodesk.Revit.DB Namespace